Basics & selection
	14.	Load a CSV into a DataFrame. Show first 5 rows, column names, and summary stats.
	15.	Select the “age” column as Series, and as DataFrame.
	16.	Filter all rows where age > 30 and gender == 'Male'.
	17.	Select only the first 3 rows and last 2 rows.
	18.	Rename a column income → salary.

⸻

GroupBy & aggregation
	19.	Group a DataFrame of employees by department and compute the average salary.
	20.	Find the count of males and females in each occupation.
	21.	For each department, get min, max, mean of years_experience.
	22.	Compute the proportion of each category in a categorical column (using value_counts(normalize=True)).

⸻

Merging & joining
	23.	Given two DataFrames: orders and customers, merge them on customer_id.
	24.	Perform an inner join, left join, and outer join on subject_id between two DataFrames.
	25.	Use pd.concat to stack two DataFrames vertically and horizontally.

⸻

Sorting & ranking
	26.	Sort a DataFrame by salary descending.
	27.	Sort by department first, then by salary ascending within each department.
	28.	Rank employees within each department by salary.

⸻

Missing values
	29.	Find rows with missing values in any column.
	30.	Fill missing values in age with the mean.
	31.	Drop rows where salary is missing.

⸻

Advanced manipulations
	32.	From a date column, extract year and month into new columns.
	33.	Pivot a DataFrame of sales with date as index, product as columns, and sales as values.
	34.	Melt (unpivot) a wide DataFrame back into long format.
	35.	Create a new column that is the z-score of salary (subtract mean, divide by std).

In [1]:
import pandas as pd
import numpy as np

# Seed for reproducibility
np.random.seed(42)

# Fake employee dataset
data = {
    "employee_id": range(1, 11),
    "name": ["Alice","Bob","Charlie","David","Eva","Frank","Grace","Helen","Ian","Jack"],
    "age": [25, 30, 45, 28, 35, 50, 29, 41, 33, 38],
    "gender": ["F","M","M","M","F","M","F","F","M","M"],
    "department": ["HR","IT","Finance","IT","HR","Finance","IT","Finance","HR","IT"],
    "years_experience": [2,5,20,3,10,25,4,15,7,12],
    "salary": [40000,55000,120000,60000,75000,130000,65000,110000,70000,80000]
}

employees = pd.DataFrame(data)

# Fake customers dataset
customers = pd.DataFrame({
    "customer_id": [101, 102, 103, 104],
    "customer_name": ["X Corp","Y Inc","Z LLC","W Ltd"]
})

# Fake orders dataset
orders = pd.DataFrame({
    "order_id": [1001,1002,1003,1004,1005],
    "customer_id": [101,101,102,104,103],
    "amount": [250, 450, 300, 500, 150]
})

employees.head()

   employee_id     name  age gender department  years_experience  salary
0            1    Alice   25      F         HR                 2   40000
1            2      Bob   30      M         IT                 5   55000
2            3  Charlie   45      M    Finance                20  120000
3            4    David   28      M         IT                 3   60000
4            5      Eva   35      F         HR                10   75000

In [2]:
# # ✅ Rule of thumb:
# 	•	Single bracket [] → Series.
# 	•	Double brackets [[]] → DataFrame.

employees['age']

0    25
1    30
2    45
3    28
4    35
5    50
6    29
7    41
8    33
9    38
Name: age, dtype: int64

In [3]:
employees = employees.rename(columns={"income": "salary"})

In [4]:
# Group a DataFrame of employees by department and compute the average salary.
employees.groupby('department')['salary'].mean().reset_index()

  department         salary
0    Finance  120000.000000
1         HR   61666.666667
2         IT   65000.000000

In [5]:
# 20.	Find the count of males and females in each occupation.
employees.groupby(['department', 'gender']).count().reset_index()

  department gender  employee_id  name  age  years_experience  salary
0    Finance      F            1     1    1                 1       1
1    Finance      M            2     2    2                 2       2
2         HR      F            2     2    2                 2       2
3         HR      M            1     1    1                 1       1
4         IT      F            1     1    1                 1       1
5         IT      M            3     3    3                 3       3

In [6]:
# 22.	Compute the proportion of each category in a categorical column (using value_counts(normalize=True)).
employees['department'].value_counts()/employees['department'].count()

IT         0.4
HR         0.3
Finance    0.3
Name: department, dtype: float64

In [7]:
orders

   order_id  customer_id  amount
0      1001          101     250
1      1002          101     450
2      1003          102     300
3      1004          104     500
4      1005          103     150

In [8]:
# 23.	Given two DataFrames: orders and customers, merge them on customer_id.
pd.merge(orders, customers, on = 'customer_id', how = 'inner')

   order_id  customer_id  amount customer_name
0      1001          101     250        X Corp
1      1002          101     450        X Corp
2      1003          102     300         Y Inc
3      1004          104     500         W Ltd
4      1005          103     150         Z LLC

In [9]:
# 25.	Use pd.concat to stack two DataFrames vertically and horizontally.
df1 = employees.iloc[:5]
df2 = employees.iloc[5:]

# Stack vertically
vertical = pd.concat([df1, df2], axis=0)
print(vertical.head(10))

   employee_id     name  age gender department  years_experience  salary
0            1    Alice   25      F         HR                 2   40000
1            2      Bob   30      M         IT                 5   55000
2            3  Charlie   45      M    Finance                20  120000
3            4    David   28      M         IT                 3   60000
4            5      Eva   35      F         HR                10   75000
5            6    Frank   50      M    Finance                25  130000
6            7    Grace   29      F         IT                 4   65000
7            8    Helen   41      F    Finance                15  110000
8            9      Ian   33      M         HR                 7   70000
9           10     Jack   38      M         IT                12   80000

In [10]:
employees.sort_values(by = ['salary','years_experience'])

   employee_id     name  age gender department  years_experience  salary
0            1    Alice   25      F         HR                 2   40000
1            2      Bob   30      M         IT                 5   55000
3            4    David   28      M         IT                 3   60000
6            7    Grace   29      F         IT                 4   65000
8            9      Ian   33      M         HR                 7   70000
4            5      Eva   35      F         HR                10   75000
9           10     Jack   38      M         IT                12   80000
7            8    Helen   41      F    Finance                15  110000
2            3  Charlie   45      M    Finance                20  120000
5            6    Frank   50      M    Finance                25  130000

In [11]:
employees["salary_rank"] = employees.groupby("department")["salary"].rank(ascending=False)

print(employees[["name","department","salary","salary_rank"]])

      name department  salary  salary_rank
0    Alice         HR   40000          3.0
1      Bob         IT   55000          4.0
2  Charlie    Finance  120000          2.0
3    David         IT   60000          3.0
4      Eva         HR   75000          1.0
5    Frank    Finance  130000          1.0
6    Grace         IT   65000          2.0
7    Helen    Finance  110000          3.0
8      Ian         HR   70000          2.0
9     Jack         IT   80000          1.0

In [12]:
import pandas as pd

salaries = pd.Series([50000, 60000, 40000, 60000])

ranks = salaries.rank()  
print(ranks)

salaries.rank(method="dense", ascending=False)

0    2.0
1    3.5
2    1.0
3    3.5
dtype: float64

0    2.0
1    1.0
2    3.0
3    1.0
dtype: float64


Missing values
	29.	Find rows with missing values in any column.
	30.	Fill missing values in age with the mean.
	31.	Drop rows where salary is missing.

⸻

Advanced manipulations
	32.	From a date column, extract year and month into new columns.
	33.	Pivot a DataFrame of sales with date as index, product as columns, and sales as values.
	34.	Melt (unpivot) a wide DataFrame back into long format.
	35.	Create a new column that is the z-score of salary (subtract mean, divide by std).

In [13]:
rows_with_na = employees[employees.isna().any(axis=1)]

In [14]:
employees['age'] = employees['age'].fillna(employees['age'].mean())

In [ ]:
employees = employees.dropna(subset=['salary'])

df = wine_reviews.dropna(subset=['points', 'price'])  # Remove rows with NaN in 'points' or 'price'

df = wine_reviews['price'].fillna(wine_reviews['price'].median(), inplace=True)

In [19]:
# example data
df = pd.DataFrame({'date': pd.to_datetime(['2024-01-15','2024-02-20','2024-02-28'])})
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month

In [20]:
# example data
sales = pd.DataFrame({
    'date': pd.to_datetime(['2024-01-01','2024-01-01','2024-01-02','2024-01-02']),
    'product': ['A','B','A','B'],
    'sales': [10, 20, 15, 18]
})
pivoted = sales.pivot_table(index='date', columns='product', values='sales', aggfunc='sum')
pivoted

product      A   B
date
2024-01-01  10  20
2024-01-02  15  18

In [17]:
# using pivoted from above
long_sales = pivoted.reset_index().melt(id_vars='date', var_name='product', value_name='sales')

In [18]:
mu = employees['salary'].mean()
sigma = employees['salary'].std(ddof=0)  # population std; use ddof=1 for sample
employees['salary_z'] = (employees['salary'] - mu) / sigma